#------------------------------------------------------------
# 사용자 정의 함수
#------------------------------------------------------------
# 함수 기능 : 원하는 단의 구구단을 출력해주는 기능 함수
# 함수 이름 : sum
# 매개 변수 : num
# 함수 결과 : Nine
#------------------------------------------------------------

def sum(num):
    # for n in 








#------------------------------------------------------------
# 사용자 정의 함수
#------------------------------------------------------------
# 함수 기능 : 파일의 확장자를 반환해주는 기능 함수
# 함수 이름 : extract
# 매개 변수 : file_name
# 함수 결과 : str 확장자
#------------------------------------------------------------


# def extract(file_name):
#     print(file_name[file_name.rfind('.')+1])





    # result(file_name[file_name.rfind('.')+1])
    # return result



# # 함수 사용--------------------------------
# print(extract("abc.jpeg"))
# # gugudan(6)



nums=[1,2,3]











# def print_gugudan(dan):
#     """
#     입력받은 단의 구구단을 출력하는 함수

#     Parameters:
#     dan (int): 출력할 구구단의 단 수

#     Returns:
#     None
#     """
#     for i in range(1, 10):
#         print(f"{dan} * {i} = {dan * i}")

# # 예시: 사용자가 원하는 단의 구구단 출력
# dan = int(input("출력할 구구단의 단을 입력하세요: "))
# print_gugudan(dan)