#----------------------------------------------------------------
# 내장함수map(함수명 ,여러개데이터)
#----------------------------------------------------------------
# data=input('숫자 데이터 입력 : ')
# print(type(data),data) #10,2,30  입력받으면 한개의 덩어리임 '10,2,30'
# nums=data.split()
# #split()  한개문자열이 여러개문자열로 분리
# #예) '10 20 30' ===> '10,20,30' 분리
# result=map(int,nums)
# print(type(result),result)



# myfunc=int
# result2=map(myfunc,nums)
# print(type(result),result)

# print(id(int),id(myfunc))

#---------------------------------------------
#형변환 => 
# 자동형변환 : 컴퓨터가 진행, 작은 ===>큰것 
# 수동형변환 : 개발자가 진행, 큰것 ===>작은 것

a=10
b=3
print(a/b)