#------------------------------------------------------
# Dict 자료형 살펴보기
# -여러가지 데이터를 dict 타입으로 저장하기
#------------------------------------------------------
# [ 다양한 종류의 키 ]----------------------------------
## -키가 여러개 정보 합쳐서 사용하는 경우 tuple타입
## -예) 홍길동 1996, 홍길동 2000
person={'age ':20, ('홍길동',2000):1000}

##3명의 정보를 저장
p1={'name':'홍길동', 'age':20, 'jop':'학생'}
p2={'name':'마징가', 'age':00, 'jop':'영웅'}
p3={'name':'마징가', 'age':00, 'jop':'영웅'}
p4={'name':'홍길동', 'age':11, 'jop':'학생'}

persons=[p1,p2,p3,p4]
persons[0]['name']

# - 키 :-->나이데이터
persons2={20:{'name':'홍길동',  'jop':'학생'},
          00:{'name':'마징가',  'jop':'영웅'},
          98:{'name':'마징가', 'jop':'영웅'},
          11:{'name':'홍길동',  'jop':'학생'}}

print(persons2[11])

# - 키 : 이름과 나이를 데이터로 
persons3={('홍길동',20): {'jop' : '학생'},
('마징가',00): {'jop' : '학생'},
('베트맨',98): {'jop' : '학생'},
('홍길동',11): {'jop' : '학생'}}

print(persons3[('홍길동', 20)])
#prunt(persons3['홍길동'])
